Merge pull request #18 from NorthskySocial/mst-refactor
Refactor to store collections in MST + Oauth fixed
